malufis/bastaoIOT-Gateway/esp32_firmware/sdkconfig.defaults
# SDKConfig defaults para Bastao-ESP

CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

# Partition Table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# Compiler Optimization
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# Bootloader
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_BOOTLOADER_LOG_LEVEL=3

# Console
CONFIG_CONSOLE_UART_CUSTOM=y
CONFIG_CONSOLE_UART_NUM_0=y
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# Log
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y

# BT Controller
CONFIG_BT_ENABLED=y
# Aumentar stack da BTC task: minimo 4096 para GATTS+SMP no ESP32-S3
# O default de 3072 causa stack overflow silencioso durante create_attr_tab,
# corrompendo o semaforo interno work_sem e disparando o assert no FreeRTOS.
CONFIG_BT_BTC_TASK_STACK_SIZE=4096
CONFIG_BT_BTU_TASK_STACK_SIZE=4608
CONFIG_BT_BLE_50_FEATURES_SUPPORTED=y
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
CONFIG_BT_GATTS_SEND_SERVICE_CHANGE_MANUAL=y
# Desabilitar GATTC: este projeto usa apenas GATTS (servidor),
# desabilitar libera ~8KB de heap para o stack do Bluedroid
CONFIG_BT_GATTC_ENABLE=n
# Limitar bonds ao necessario (reduce NVS usage)
CONFIG_BT_SMP_MAX_BONDS=5

# Wi-Fi
CONFIG_ESP32_WIFI_ENABLED=y
CONFIG_ESP32_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP32_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP32_WIFI_TX_BUFFER_NUM=32

# MQTT
CONFIG_MQTT_TRANSPORT_SSL=y
CONFIG_MQTT_TRANSPORT_WEBSOCKET=y

# NVS
CONFIG_NVS_ENCRYPTION=y
CONFIG_NVS_SEC_HMAC_EFUSE_KEY_ID=0

# ESP HTTPS OTA
CONFIG_ESP_HTTPS_OTA_DECRYPT_CB=y

# SPIFFS
CONFIG_SPIFFS_USE_MAGICMEM=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# PPP (nao utilizado - modo AT commands)
CONFIG_LWIP_PPP_SUPPORT=n

# Flash size
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# IRAM optimizations (prevent overflow)
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n
CONFIG_ESP_PHY_IRAM_OPT=n

# BLE Mesh (Coordenador/Provisioner para v5.4/v5.5)
CONFIG_BLE_MESH=y
CONFIG_BLE_MESH_HCI_5_0=y
CONFIG_BLE_MESH_V11_SUPPORT=y
CONFIG_BLE_MESH_PROVISIONER=y
CONFIG_BLE_MESH_PROV=y
CONFIG_BLE_MESH_PB_ADV=y
CONFIG_BLE_MESH_DEINIT=y
CONFIG_BLE_MESH_PROXY=y
CONFIG_BLE_MESH_GATT_PROXY_SERVER=y
CONFIG_BLE_MESH_RELAY=y
CONFIG_BLE_MESH_SUBNET_COUNT=3
CONFIG_BLE_MESH_APP_KEY_COUNT=3
CONFIG_BLE_MESH_MODEL_KEY_COUNT=3
CONFIG_BLE_MESH_MODEL_GROUP_COUNT=3
CONFIG_BLE_MESH_CRPL=10
CONFIG_BLE_MESH_RX_SDU_MAX=384
CONFIG_BLE_MESH_TX_SEG_MSG_COUNT=12
CONFIG_BLE_MESH_RX_SEG_MSG_COUNT=12
CONFIG_BLE_MESH_TX_SEG_MAX=32
CONFIG_BLE_MESH_CLIENT_MSG_TIMEOUT=4000
CONFIG_BLE_MESH_DISCARD_OLD_SEQ_AUTH=y
CONFIG_BLE_MESH_CFG_CLI=y
CONFIG_BLE_MESH_SETTINGS=y
CONFIG_BLE_MESH_STORE_TIMEOUT=0
CONFIG_BLE_MESH_SEQ_STORE_RATE=0
CONFIG_BLE_MESH_RPL_STORE_TIMEOUT=0